/* // Продемонстрировать одномерный массив.
using System;

class ArrayDemo {
    static void Main() {
        int[] sample = new int[10];
        int i;
        for(i = 0; i < 10; i = i+1)
            sample[i] = i;
        for(i = 0; i < 10; i = i+1)
            Console.WriteLine("sample[" + i + "]: " + sample[i]);
    }
} */
//---------------------------------------------------------------------------------
//=================================================================================
//---------------------------------------------------------------------------------
        //СТРОКИ
/* 
string s1 = "Geek";
string s2 = "Brains";
string s3 = "C#";

string s = s1 + s2 + ":" + " " + s3;
Console.WriteLine(s);
string s5 = string.Concat(s1, s2, s3);
Console.WriteLine(s5); */

//=================================================================================
//=================================================================================
//=================================================================================
// Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
//      7 -> 28
//      4 -> 10
/* Console.Clear();
Console.WriteLine("Введите число: ");
int A = Convert.ToInt32(Console.ReadLine());
int i = 0;
int result = 0;
while (i < A)
{
    result =result + i;    
    i++;
}
//return result;
Console.WriteLine(result); */

//=================================================================================
//=================================================================================
//=================================================================================
//Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
//      456 -> 3
//      78 -> 2
//      89126 -> 5

/* Console.Clear();
Console.WriteLine("Введите число: ");
int A = Convert.ToInt32(Console.ReadLine());
int numberLength = 0;   //объявили переменную, для счёта цифр
while(A >= 1)
{
    A = A/10;
    numberLength++;
}
Console.WriteLine(numberLength); */

//=================================================================================
//=================================================================================
//=================================================================================
//Задача 28: Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
//      4 -> 24
//      5 -> 120

/* Console.Clear();
Console.WriteLine("Введите число: ");
int A = Convert.ToInt32(Console.ReadLine());
int result = 1;
int i = 1;
while (i < A)
{
    result = result * i;
    i++;
}
Console.WriteLine(result); */

//=================================================================================
//=================================================================================
//=================================================================================
//Задача 30: Напишите программу, которая выводит массив из 8 элементов,
// заполненный нулями и единицами в случайном порядке.
//      [1,0,1,1,0,1,0,0]

/* Console.Clear();
int[] array = new int[8];
Random rnd = new Random();
for (int i = 0; i < array.Length; i++)
{
    array[i] = rnd.Next(0,2);
    Console.WriteLine(array[i]+" ");
} */

//      ИЛИ ТАК!!!!!!
/* Console.Clear();
int[] array = new int[8];
void PrintArray(int[] array)
{
    int count = array.Length;
    for ( int i = 0; i < count; i++)
    {
        array[i] = new Random().Next(0,2);
        Console.WriteLine($"{array[i]} ");
    }
    Console.WriteLine();
}
PrintArray(array); */

//          или так!!!!

/* int[] array = new int[8];

for(int i = 0; i < 8; i++){
array[i] = new Random().Next(0,50);
System.Console.Write($"{array[i]}, ");
} */

//=====================================================================
//=====================================================================
//=====================================================================

//У нас есть график, где даны отрезок 1 - (х1; x2) и отрезок 2 (х3, x4)
//Необходимо составить код, который находит их пересечение.
//Пересечением двух отрезка 1 и 2 могут быть - отрезок, точка или ничего
//С клавиатуры вводим х1, x2, х3, x4 и выводим ответ - границы пересечений отрезков,
// общую точку или «не пересекаются».

