/* Console.Clear();

//int num = 3;

int[] numbers = new int[5] {1, 2, 3, 4, 5};  //создали массив...=...задали размер массива
string[] name = {"Anne", "Bob", "John", "Kris", "Ama"};

//numbers[3] = numbers[3] + 10; //изменяем значение индекса(в ячейке)...
//Console.Write($"{name[3]} !!!");    //обращаемся к нашему массиву в ячейку "3"...
Console.Write($"{numbers[numbers.Length - 2]} !!!");    //выводим предпоследний индекс(ячейку) массива

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Console.Write($"{name[3]} !!!");
Console.Write($"{Math.Abs(name[3])} !!!");  //показывает модуль числа...
Console.Write($"{Math.Pow(name[3], 3)} !!!");  //возводим в третью степень!!!
//++++++++++++++++++++++++++++++++++++++++++++++++++++++
doble resultd = Math.Round(17.137, 1);     //округляем дробные числа до какой-л. цифры....
Console.Write(resultd);

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Console.Write(Math.Sqrt(resultd));  //извлекаем корень из...


for (int i = 0; i < name.Length; i++) 
Console.WriteLine($"{i} элемент это {name[i]} !!!"); */

//___________________________________________________________________________________________________________
//___________________________________________________________________________________________________________
//-----------------------------------------------------------------------------------------------------------
//17. Напишите программу, которая принимает на вход координаты точки (X и Y),
// причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.
//-----------------------------------------------------------------------------------------------------------
/* Console.Clear();
Console.WriteLine("Введите координату x: ");
int x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координату y: ");
int y = Convert.ToInt32(Console.ReadLine());
if(x > 0 & y > 0)
{
    Console.WriteLine("Координаты относятся к 1-й четверти");
}
else if (x < 0 & y > 0)
    {
        Console.WriteLine("Координаты относятся ко 2-й четверти");
        
    }
else if (x < 0 & y < 0)
        {
            Console.WriteLine("Координаты относятся к 3-й четверти");
            
        }
else if (x > 0 & y < 0)
    {
     Console.WriteLine("Координаты относятся к 4-й четверти");
    }
else
{
    Console.WriteLine("Введите координату отличную от нуля!!!");
} */

//___________________________________________________________________________________________________________
//___________________________________________________________________________________________________________
//-----------------------------------------------------------------------------------------------------------
//Задача 18: Напишите программу, которая по заданному номеру четверти,
// показывает диапазон возможных координат точек в этой четверти (x и y).
//-----------------------------------------------------------------------------------------------------------
/* Console.Clear();
Console.WriteLine("Введите номер четверти: ");
int num = Convert.ToInt32(Console.ReadLine());
if (num == 1) Console.WriteLine("x > 0, y > 0");
if (num == 2) Console.WriteLine("x < 0, y > 0");
if (num == 3) Console.WriteLine("x < 0, y < 0");
if (num == 4) Console.WriteLine("x > 0, y < 0"); */
//else Console.WriteLine("(X or Y) = 0 ");

//___________________________________________________________________________________________________________
//___________________________________________________________________________________________________________
//-----------------------------------------------------------------------------------------------------------
//Задача 21: Напишите программу, которая принимает на вход координаты двух точек 
//и находит расстояние между ними в 2D пространстве.
//      A (3,6); B (2,1) -> 5,09
//      A (7,-5); B (1,-1) -> 7,21
//-----------------------------------------------------------------------------------------------------------

/* Console.Clear();
Console.WriteLine("Введите координаты первой точки: ");
int[] A = new int[2] {Convert.ToInt32(Console.ReadLine()), Convert.ToInt32(Console.ReadLine())};
Console.WriteLine("Введите координаты второй точки: ");
int[] B = new int[2] {Convert.ToInt32(Console.ReadLine()), Convert.ToInt32(Console.ReadLine())};
Console.WriteLine($"{Math.Sqrt((Math.Pow((B[0]-A[0]), 2) + (Math.Pow((B[1]-A[1]), 2))))}"); */


//___________________________________________________________________________________________________________
//___________________________________________________________________________________________________________
//Задача 22: Напишите программу, которая принимает на вход число (N)
// и выдаёт таблицу квадратов чисел от 1 до N.
//      5 -> 1, 4, 9, 16, 25.
//      2 -> 1,4
//-----------------------------------------------------------------------------------------------------------

/* Console.Clear();
Console.WriteLine("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
for (int i =1; i < N; i++)
{
    Console.WriteLine(Math.Pow(i, 2));
} */