//Задача 64: Задайте значение N. Напишите программу, которая выведет
// все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
//  N = 5 -> "5, 4, 3, 2, 1"
//  N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

Console.Clear();
/* Console.Write("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
int count = 1;
numbers(N, count);


void numbers(int n, int count)
{
    if (count > n)
    {
        return;
    }
    else
    {
        numbers(n, count + 1);
        Console.Write(count + " ");
    }
} */
//---------------------------------------------------------------------------------
//---------------------------------------------------------------------------------
//Задача 66: Задайте значения M и N. Напишите программу, которая найдёт
// сумму натуральных элементов в промежутке от M до N.
//      M = 1; N = 15 -> 120
//      M = 4; N = 8. -> 30

/* Console.Write("Введите число M: ");
int m = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число N: ");
int n = Convert.ToInt32(Console.ReadLine());

void PrintSum(int m, int n, int sum)
{
    sum = sum + n;
    if (n <= m)
    {
        Console.Write($" {sum} ");
        return;
    }
    PrintSum(m, n - 1, sum);
}

int temp = m;
if (m > n)
{
    m = n;
    n = temp;
}
Console.Write($"Сумма натуральных элементов в промежутке -> [{m},{n}] равна ");
PrintSum(m, n, temp = 0); */

//-----------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------
//Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии.
// Даны два неотрицательных числа m и n.
//      m = 2, n = 3 -> A(m,n) = 9
//      m = 3, n = 2 -> A(m,n) = 29

/* Console.Write("Введите число M: ");
int m = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите число N: ");
int n = Convert.ToInt32(Console.ReadLine()); */

//На досуге попробую изучить енту тему((((