Console.Clear();

/* int Fact(int num)
{
    if(num == 1) return 1;//
    return num* Fact(num - 1);//
}

int x = Fact(4);
Console.WriteLine(x); */
//------------------------------------------------------------------------------
//Задача 63: Задайте значение N. Напишите программу,
// которая выведет все натуральные числа в промежутке от 1 до N.
//      N = 5 -> "1, 2, 3, 4, 5"
//      N = 6 -> "1, 2, 3, 4, 5, 6"


/* void NaturNum(int numb)
{
    if (numb > 0)
    {
        NaturNum(numb - 1);
        Console.Write(numb + " ");
    }
}
NaturNum(5); */

//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//Задача 65: Задайте значения M и N. Напишите программу,
// которая выведет все натуральные числа в промежутке от M до N.
//      M = 1; N = 5 -> "1, 2, 3, 4, 5"
//      M = 4; N = 8 -> "4, 6, 7, 8"

/* Console.Write($"Введите число: ");
int x = Convert.ToInt32(Console.ReadLine());
Console.Write($"Введите число: ");
int y = Convert.ToInt32(Console.ReadLine()); */

/* void NaturNum(int x, int y)
{
    if (x == y) return 0;
    else return NaturNum(x + 1, y);
}

//NaturNum(5, 10);
Console.Write(NaturNum(1,9)); */

//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//Задача 67: Напишите программу, которая будет принимать
// на вход число и возвращать сумму его цифр.
//      453 -> 12
//      45 -> 9

/* Console.WriteLine("Введите число: ");
int A = Convert.ToInt32(Console.ReadLine());

int Summ(int result)
{
    int result = 0;
    if (result > 0)
    {
        result = Summ + A % 10;
        A = A / 10;

    }
Console.WriteLine(result);
}
Summ(result); */

//Задача 69: Напишите программу, которая на вход принимает два числа A и B,
// и возводит число А в целую степень B с помощью рекурсии.
//      A = 3; B = 5 -> 243 (3⁵)
//      A = 2; B = 3 -> 8



